# Требуется найти в списке A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в списке. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*
#     5
#     1 2 3 4 5
#     6
#     -> 5

#//////////////////////////- Ввод данных -//////////////////////////////////////////////
N = int(input('Введите количество элементов в списке: '))
A = list(map(int, input('Введите значение элементов в списке, через пробел: ').split()))
X = int(input('Введите число Х: '))
#///////- Инициализация переменной для хранения индекса ближайшего элемента -///////////
closest_index = 0
#//////////-  Инициализация переменной для хранения наименьшей разницы -///////////////
min_difference = abs(A[0] - X)
#//////////////////////////- Решение задачи -////////////////////////////////////////////
for i in range(1, N):
    difference = abs(A[i] - X)
    if difference < min_difference:
        min_difference = difference
        closest_index = i

#/////////////////////////- Вывод результата -///////////////////////////////////////////
print(A[closest_index])
#///////////////////////////////- Конец -////////////////////////////////////////////////