# Требуется вычислить, сколько раз встречается некоторое число X в списке A[1..N]. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в списке. В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X
# *Пример:*
#     5
#     1 2 3 4 5
#     3
#     -> 1


#//////////////////////////- Ввод данных -//////////////////////////////////////////////
N = int(input('Введите количество элементов в списке: '))
A = list(map(int, input('Введите значение элементов в списке, через пробел: ').split()))
X = int(input('Введите число Х: '))
#//////////- Инициализация переменной для подсчета количества вхождений -////////////////
count = 0
#//////////////////////////- Решение задачи -////////////////////////////////////////////
for num in A:
    if num == X:
        count += 1

#/////////////////////////- Вывод результата -///////////////////////////////////////////
print(count)
#///////////////////////////////- Конец -////////////////////////////////////////////////